## Staging: api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| update | `aws_ssm_parameter.api_auth_token`                       |
|        | `module.url_shortener_lambda.aws_iam_policy.policies[0]` |
|        | `module.url_shortener_lambda.aws_lambda_function.this`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "api_policies" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:843973686572:parameter/api_auth_token",
            ]
        }
    }

  # aws_ssm_parameter.api_auth_token will be updated in-place
  ~ resource "aws_ssm_parameter" "api_auth_token" {
        id              = "api_auth_token"
      + insecure_value  = (known after apply)
        name            = "api_auth_token"
        tags            = {
            "CostCentre" = "url-shortener-staging"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 4 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.url_shortener_lambda.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::843973686572:policy/url-shortener-api-0"
        name      = "url-shortener-api-0"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:843973686572:parameter/api_auth_token"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "url-shortener-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.url_shortener_lambda.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "url-shortener-api"
        tags                           = {
            "CostCentre" = "url-shortener-staging"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "ALLOWED_DOMAINS"           = "canada.ca,gc.ca"
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
